{
  "system": "5e2024",
  "resource_id": "item",
  "stats": {
    "name": {
      "value": "Book of Vile Darkness"
    },
    "source": {
      "value": "dmg"
    },
    "description": {
      "value": "The contents of this foul manuscript are the meat and drink of the wicked. It contains knowledge so horrid that to even glimpse the scrawled pages invites doom.\n\nMost believe the lich-god Vecna authored the Book of Vile Darkness. He recorded in its pages every horrid idea, every corrupt thought, and every example of foul magic he came across or devised.\n\nOther practitioners of evil have added their own input to the book's catalog of vile knowledge. Their additions are clear, for the writers of later works stitched whatever they were writing into the tome or, in some cases, made notations and additions to existing text. There are places where pages are missing, torn, or covered so completely with ink, blood, and scratches that the original text can't be divined.\n\nNature can't abide the book's presence. Ordinary plants wither in its presence, common animals are unwilling to approach it, and the book gradually destroys whatever it touches. Even stone cracks and turns to powder if the book rests on it long enough.\n\nWhenever a creature that isn't a Fiend or an Undead attunes to the Book of Vile Darkness, that creature makes a DC 17 Charisma saving throw. On a failed save, the creature is magically transformed into a Larva under the DM's control. Only a Wish spell can reverse this vile transformation.\n\nA creature attuned to the book must spend 80 hours reading and studying it to digest its contents and use its Adjusted Ability Scores, Tireless Form, Spells, Vile Lore, and Vile Speech properties.\n\nThe Book of Vile Darkness remains with you only as long as you strive to work evil in the world. If you fail to perform at least one evil act within the span of 10 days, or if you willingly perform a good act, the book disappears, your Attunement to it ends immediately, and you lose all benefits granted by it. If you die while attuned to the book, an entity of great evil claims your soul. You can't be restored to life by any means while your soul remains imprisoned.\n\nAdjusted Ability Scores. One ability score of your choice increases by 2, to a maximum of 24. Another ability score of your choice decreases by 2, to a minimum of 3. The book can't adjust your ability scores again.\n\nTireless Form. While the book is on your person, you have Immunity to the Exhaustion condition.\n\nRandom Properties. The Book of Vile Darkness has the following random properties:\n\n- 3 minor beneficial properties\n- 1 major beneficial property\n- 3 minor detrimental properties\n- 2 major detrimental properties\n\nSpells. While holding the book and holding it, you can cast the following spells (save DC 18) from it:\n\n- Animate Dead\n- Circle of Death\n- Dominate Monster\n- Finger of Death\n\nOnce you use the book to cast a spell, you can't cast that spell again from it until the next dawn.\n\nVile Lore. You can reference the Book of Vile Darkness whenever you make an Intelligence check to recall information about some aspect of evil, such as lore about demons. When you do so, you have Advantage on that check.\n\nAt the DM's discretion, the book might reveal secrets no mortal should know, such as the true names of powerful Fiends, foul rites that allow one to transform into a death knight or lich, or long-lost spells crafted by beings so evil their names ought never to be spoken aloud.\n\nVile Speech. While the book is on your person, you can take a Magic action to recite words from its pages in a foul, dead language. Each time you do so, you take 1d12 Psychic damage, and each creature within 15 feet of you takes 3d6 Psychic damage unless the creature is a Fiend or an Undead.\n\nDestroying the Book. The Book of Vile Darkness allows pages to be torn from it, but any evil lore contained on those pages finds its way back into the book eventually, usually when a new author adds pages to the tome.\n\nIf a solar tears the book in two, the book is destroyed for 1d100 years, after which it re-forms in some far corner of the multiverse.\n\nA creature attuned to the book for 100 years can unearth a phrase hidden in the original text that, when translated to Celestial and spoken aloud, destroys both the speaker and the book in a flash of radiance. However, as long as evil exists in the multiverse, the book re-forms 1d10 × 100 years later"
    },
    "type": {
      "value": "wondrous"
    },
    "cost": {
      "value": {
        "system": "5e2024",
        "resource_id": "cost",
        "stats": {
          "unit": {
            "value": "gold"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.717716"
          },
          "id": "637dbfb3-8c99-4b8f-aab6-46f52c789c96"
        }
      }
    },
    "weight": {
      "value": {
        "system": "5e2024",
        "resource_id": "weight",
        "stats": {
          "value": {
            "value": 5
          },
          "unit": {
            "value": "pounds"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.717720"
          },
          "id": "43045959-51d3-4908-8a9b-72be4d727b28"
        }
      }
    },
    "rarity": {
      "value": "artifact"
    },
    "is_magic": {
      "value": true
    },
    "requires_attunement": {
      "value": true
    },
    "effects": {
      "value": [
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Cast Dominate Monster"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "87e72df3-ae43-4624-bb92-dc0ada29226e"
                }
              }
            },
            "has_charges": {
              "value": true
            },
            "recharge_event": {
              "value": "dawn"
            },
            "max_charges_constant": {
              "value": 1
            },
            "recharges": {
              "value": {
                "system": "5e2024",
                "resource_id": "dice_roll",
                "stats": {
                  "constant": {
                    "value": 1
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:35.717728"
                  },
                  "id": "0097dd30-447c-4b86-8d6d-29023d3ccc5f"
                }
              }
            },
            "type": {
              "value": "use_spell"
            },
            "spell": {
              "value": {
                "system": "5e2024",
                "resource_id": "spell",
                "stats": {
                  "name": {
                    "value": "Dominate Monster"
                  },
                  "source": {
                    "value": "phb"
                  },
                  "level": {
                    "value": "spell_level_8"
                  },
                  "school": {
                    "value": "spell_school_enchantment"
                  },
                  "casting_time": {
                    "value": "1 action"
                  },
                  "range": {
                    "value": "60 feet"
                  },
                  "duration": {
                    "value": "Concentration, up to 1 hour"
                  },
                  "verbal": {
                    "value": true
                  },
                  "somatic": {
                    "value": true
                  },
                  "description": {
                    "value": "One creature you can see within range must succeed on a Wisdom saving throw or have the Charmed condition for the duration. The target has Advantage on the save if you or your allies are fighting it. Whenever the target takes damage, it repeats the save, ending the spell on itself on a success.\n\nYou have a telepathic link with the Charmed target while the two of you are on the same plane of existence. On your turn, you can use this link to issue commands to the target (no action required), such as \"Attack that creature,\" \"Move over there,\" or \"Fetch that object.\" The target does its best to obey on its turn. If it completes an order and doesn't receive further direction from you, it acts and moves as it likes, focusing on protecting itself.\n\nYou can command the target to take a Reaction but must take your own Reaction to do so"
                  },
                  "higher_level_description": {
                    "value": "Your Concentration can last longer with a level 9 spell slot (up to 8 hours)"
                  },
                  "classes": {
                    "value": [
                      "bard",
                      "sorcerer",
                      "warlock",
                      "wizard"
                    ]
                  },
                  "dice": {
                    "value": []
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:46.639386"
                  },
                  "id": "c7d05ad5-40ed-47c8-8a93-dd2d885a3833"
                }
              }
            },
            "updated_at": {
              "value": "2024-12-20T18:50:35.717734"
            },
            "id": "52513129-6326-4365-9606-f606c276c375"
          }
        },
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Cast animate dead"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "899924f4-1655-4fac-a3f5-0ec4d3a6dcae"
                }
              }
            },
            "has_charges": {
              "value": true
            },
            "recharge_event": {
              "value": "dawn"
            },
            "max_charges_constant": {
              "value": 1
            },
            "type": {
              "value": "use_spell"
            },
            "spell": {
              "value": {
                "system": "5e2024",
                "resource_id": "spell",
                "stats": {
                  "name": {
                    "value": "Animate Dead"
                  },
                  "source": {
                    "value": "phb"
                  },
                  "level": {
                    "value": "spell_level_3"
                  },
                  "school": {
                    "value": "spell_school_necromancy"
                  },
                  "casting_time": {
                    "value": "1 minute"
                  },
                  "range": {
                    "value": "10 feet"
                  },
                  "duration": {
                    "value": "Instantaneous"
                  },
                  "verbal": {
                    "value": true
                  },
                  "somatic": {
                    "value": true
                  },
                  "material": {
                    "value": true
                  },
                  "components": {
                    "value": "a drop of blood, a piece of flesh, and a pinch of bone dust"
                  },
                  "description": {
                    "value": "Choose a pile of bones or a corpse of a Medium or Small Humanoid within range. The target becomes an Undead creature: a Skeleton if you chose bones or a Zombie if you chose a corpse.\n\nOn each of your turns, you can take a Bonus Action to mentally command any creature you made with this spell if the creature is within 60 feet of you (if you control multiple creatures, you can command any of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move on its next turn, or you can issue a general command, such as to guard a chamber or corridor. If you issue no commands, the creature takes the Dodge action and moves only to avoid harm. Once given an order, the creature continues to follow it until its task is complete.\n\nThe creature is under your control for 24 hours, after which it stops obeying any command you've given it. To maintain control of the creature for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends. This use of the spell reasserts your control over up to four creatures you have animated with this spell rather than animating a new creature"
                  },
                  "higher_level_description": {
                    "value": "When you cast this spell using a spell slot of 4th level or higher, you animate or reassert control over two additional undead creatures for each slot level above 3rd. Each of the creatures must come from a different corpse or pile of bones."
                  },
                  "classes": {
                    "value": [
                      "cleric",
                      "fighter",
                      "rogue",
                      "wizard"
                    ]
                  },
                  "dice": {
                    "value": []
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:46.627288"
                  },
                  "id": "d0bb3ae8-d378-407d-bc80-9cce6837c2be"
                }
              }
            },
            "id": "83ee4018-c6d5-48ff-8a89-f0d602b5609b"
          }
        },
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Cast circle of death"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "b2794eef-8c48-42ae-8a46-3a9b6c10d807"
                }
              }
            },
            "has_charges": {
              "value": true
            },
            "recharge_event": {
              "value": "dawn"
            },
            "max_charges_constant": {
              "value": 1
            },
            "type": {
              "value": "use_spell"
            },
            "spell": {
              "value": {
                "system": "5e2024",
                "resource_id": "spell",
                "stats": {
                  "name": {
                    "value": "Circle of Death"
                  },
                  "source": {
                    "value": "phb"
                  },
                  "level": {
                    "value": "spell_level_6"
                  },
                  "school": {
                    "value": "spell_school_necromancy"
                  },
                  "casting_time": {
                    "value": "1 action"
                  },
                  "range": {
                    "value": "150 feet"
                  },
                  "duration": {
                    "value": "Instantaneous"
                  },
                  "verbal": {
                    "value": true
                  },
                  "somatic": {
                    "value": true
                  },
                  "material": {
                    "value": true
                  },
                  "components": {
                    "value": "the powder of a crushed black pearl worth at least 500 gp"
                  },
                  "description": {
                    "value": "Negative energy ripples out in a 60-foot-radius Sphere from a point you choose within range. Each creature in that area makes a Constitution saving throw, taking 8d8 Necrotic damage on a failed save or half as much damage on a successful one"
                  },
                  "higher_level_description": {
                    "value": "When you cast this spell using a spell slot of 7th level or higher, the damage increases by 2d8 for each slot level above 6th."
                  },
                  "classes": {
                    "value": [
                      "sorcerer",
                      "warlock",
                      "wizard"
                    ]
                  },
                  "dice": {
                    "value": [
                      {
                        "system": "5e2024",
                        "resource_id": "levelled_damage_dice",
                        "stats": {
                          "level": {
                            "value": 6
                          },
                          "damage_dice": {
                            "value": [
                              {
                                "system": "5e2024",
                                "resource_id": "damage_dice",
                                "stats": {
                                  "dices": {
                                    "value": [
                                      {
                                        "system": "5e2024",
                                        "resource_id": "dice_roll",
                                        "stats": {
                                          "dice_amount": {
                                            "value": 8
                                          },
                                          "dice_type": {
                                            "value": "d8"
                                          },
                                          "updated_at": {
                                            "value": "2024-12-20T18:50:46.647840"
                                          },
                                          "id": "aa11320e-670d-4b9d-b016-51481ee66617"
                                        }
                                      }
                                    ]
                                  },
                                  "damage_type": {
                                    "value": "necrotic"
                                  },
                                  "updated_at": {
                                    "value": "2024-12-20T18:50:46.647846"
                                  },
                                  "id": "950d2015-86ea-4285-a58c-cd75b58aa801"
                                }
                              }
                            ]
                          },
                          "updated_at": {
                            "value": "2024-12-20T18:50:46.647851"
                          },
                          "id": "5dd287e3-d963-422f-8209-aa8aabc99dd4"
                        }
                      },
                      {
                        "system": "5e2024",
                        "resource_id": "levelled_damage_dice",
                        "stats": {
                          "level": {
                            "value": 7
                          },
                          "damage_dice": {
                            "value": [
                              {
                                "system": "5e2024",
                                "resource_id": "damage_dice",
                                "stats": {
                                  "dices": {
                                    "value": [
                                      {
                                        "system": "5e2024",
                                        "resource_id": "dice_roll",
                                        "stats": {
                                          "dice_amount": {
                                            "value": 10
                                          },
                                          "dice_type": {
                                            "value": "d8"
                                          },
                                          "updated_at": {
                                            "value": "2024-12-20T18:50:46.647860"
                                          },
                                          "id": "5e75b4cd-defb-464c-8065-c3c407d54b50"
                                        }
                                      }
                                    ]
                                  },
                                  "damage_type": {
                                    "value": "necrotic"
                                  },
                                  "updated_at": {
                                    "value": "2024-12-20T18:50:46.647865"
                                  },
                                  "id": "acf5aaff-3db8-41a7-ba6c-e2a7624f5aaf"
                                }
                              }
                            ]
                          },
                          "updated_at": {
                            "value": "2024-12-20T18:50:46.647870"
                          },
                          "id": "1f2166ee-6faa-4602-b4c6-6be80b6517fe"
                        }
                      },
                      {
                        "system": "5e2024",
                        "resource_id": "levelled_damage_dice",
                        "stats": {
                          "level": {
                            "value": 8
                          },
                          "damage_dice": {
                            "value": [
                              {
                                "system": "5e2024",
                                "resource_id": "damage_dice",
                                "stats": {
                                  "dices": {
                                    "value": [
                                      {
                                        "system": "5e2024",
                                        "resource_id": "dice_roll",
                                        "stats": {
                                          "dice_amount": {
                                            "value": 12
                                          },
                                          "dice_type": {
                                            "value": "d8"
                                          },
                                          "id": "66936261-92c7-4b79-9a07-5cc2c3e8f8d9"
                                        }
                                      }
                                    ]
                                  },
                                  "damage_type": {
                                    "value": "necrotic"
                                  },
                                  "id": "a391a25f-3fce-49d3-bb1e-cfb41913859e"
                                }
                              }
                            ]
                          },
                          "id": "1846e697-d51e-4031-82ea-de85661b24d6"
                        }
                      },
                      {
                        "system": "5e2024",
                        "resource_id": "levelled_damage_dice",
                        "stats": {
                          "level": {
                            "value": 9
                          },
                          "damage_dice": {
                            "value": [
                              {
                                "system": "5e2024",
                                "resource_id": "damage_dice",
                                "stats": {
                                  "dices": {
                                    "value": [
                                      {
                                        "system": "5e2024",
                                        "resource_id": "dice_roll",
                                        "stats": {
                                          "dice_amount": {
                                            "value": 14
                                          },
                                          "dice_type": {
                                            "value": "d8"
                                          },
                                          "id": "b88cfb8b-f20d-4a82-acfe-41799f1ffc20"
                                        }
                                      }
                                    ]
                                  },
                                  "damage_type": {
                                    "value": "necrotic"
                                  },
                                  "id": "4253559f-4d3a-43c8-882c-a68209834924"
                                }
                              }
                            ]
                          },
                          "id": "47fc1cee-e2c0-462e-b5ca-64d5134ff044"
                        }
                      }
                    ]
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:46.647872"
                  },
                  "id": "406ce1bb-afac-4608-8d92-4657463ec8b4"
                }
              }
            },
            "id": "9b32e1cb-1818-475b-af43-af26777eaf47"
          }
        },
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Cast finger of death"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "0f2b8b92-b76f-4b63-be97-de7b6c0b5fbf"
                }
              }
            },
            "has_charges": {
              "value": true
            },
            "recharge_event": {
              "value": "dawn"
            },
            "max_charges_constant": {
              "value": 1
            },
            "type": {
              "value": "use_spell"
            },
            "spell": {
              "value": {
                "system": "5e2024",
                "resource_id": "spell",
                "stats": {
                  "name": {
                    "value": "Finger of Death"
                  },
                  "source": {
                    "value": "phb"
                  },
                  "level": {
                    "value": "spell_level_7"
                  },
                  "school": {
                    "value": "spell_school_necromancy"
                  },
                  "casting_time": {
                    "value": "1 action"
                  },
                  "range": {
                    "value": "60 feet"
                  },
                  "duration": {
                    "value": "Instantaneous"
                  },
                  "verbal": {
                    "value": true
                  },
                  "somatic": {
                    "value": true
                  },
                  "description": {
                    "value": "You unleash negative energy toward a creature you can see within range. The target makes a Constitution saving throw, taking 7d8 + 30 Necrotic damage on a failed save or half as much damage on a successful one.\n\nA Humanoid killed by this spell rises at the start of your next turn as a Zombie that follows your verbal orders"
                  },
                  "classes": {
                    "value": [
                      "sorcerer",
                      "warlock",
                      "wizard"
                    ]
                  },
                  "dice": {
                    "value": [
                      {
                        "system": "5e2024",
                        "resource_id": "levelled_damage_dice",
                        "stats": {
                          "level": {
                            "value": 7
                          },
                          "damage_dice": {
                            "value": [
                              {
                                "system": "5e2024",
                                "resource_id": "damage_dice",
                                "stats": {
                                  "dices": {
                                    "value": [
                                      {
                                        "system": "5e2024",
                                        "resource_id": "dice_roll",
                                        "stats": {
                                          "dice_amount": {
                                            "value": 7
                                          },
                                          "dice_type": {
                                            "value": "d8"
                                          },
                                          "constant": {
                                            "value": 30
                                          },
                                          "updated_at": {
                                            "value": "2024-12-20T18:50:46.644324"
                                          },
                                          "id": "8e0ea842-ddd1-4264-bc80-86d970781536"
                                        }
                                      }
                                    ]
                                  },
                                  "damage_type": {
                                    "value": "necrotic"
                                  },
                                  "updated_at": {
                                    "value": "2024-12-20T18:50:46.644330"
                                  },
                                  "id": "544248a6-7541-49cc-a0e9-339ff5147895"
                                }
                              }
                            ]
                          },
                          "updated_at": {
                            "value": "2024-12-20T18:50:46.644335"
                          },
                          "id": "a2f36318-7b83-444b-ad09-1a77fc4dd789"
                        }
                      }
                    ]
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:46.644338"
                  },
                  "id": "4bcad085-e77d-4eeb-9025-7f11f6faf500"
                }
              }
            },
            "id": "a64ef355-3f9d-436d-8191-24a52f61f24e"
          }
        }
      ]
    },
    "updated_at": {
      "value": "2024-12-20T18:50:35.717735"
    },
    "id": "book_of_vile_darkness"
  }
}
