{
  "system": "5e2024",
  "resource_id": "item",
  "stats": {
    "name": {
      "value": "Pipes of the Sewers"
    },
    "source": {
      "value": "dmg"
    },
    "description": {
      "value": "While these pipes are on your person, ordinary rats and giant rats are Indifferent toward you and won't attack you unless you threaten or harm them.\n\nThe pipes have 3 charges and regain 1d3 expended charges daily at dawn. If you play the pipes as a Magic action, you can take a Bonus Action to expend 1 to 3 charges, calling forth one Swarm of Rats with each expended charge if enough rats are within half a mile of you to be called in this fashion (as determined by the DM). If there aren't enough rats to form a swarm, the charge is wasted. Called swarms move toward the music by the shortest available route but aren't under your control otherwise.\n\nWhenever a Swarm of Rats that isn't under another creature's control comes within 30 feet of you while you are playing the pipes, the swarm makes a DC 15 Wisdom saving throw. On a successful save, the swarm behaves as it normally would and can't be swayed by the pipes' music for the next 24 hours. On a failed save, the swarm is swayed by the pipes' music and becomes Friendly to you and your allies for as long as you continue to play the pipes each round as a Magic action. A Friendly swarm obeys your commands. If you issue no commands to a Friendly swarm, it defends itself but otherwise takes no actions. If a Friendly swarm starts its turn more than 30 feet away from you, your control over that swarm ends, and the swarm behaves as it normally would and can't be swayed by the pipes' music for the next 24 hours"
    },
    "type": {
      "value": "wondrous"
    },
    "cost": {
      "value": {
        "system": "5e2024",
        "resource_id": "cost",
        "stats": {
          "id": "253f72fe-75d5-4a2b-9f27-32a151bfe400"
        }
      }
    },
    "weight": {
      "value": {
        "system": "5e2024",
        "resource_id": "weight",
        "stats": {
          "id": "b6c9db3e-13a8-472c-9413-95ca83768b0e"
        }
      }
    },
    "rarity": {
      "value": "uncommon"
    },
    "is_magic": {
      "value": true
    },
    "requires_attunement": {
      "value": true
    },
    "effects": {
      "value": [
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Charges"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "611dfac5-4a5f-48b8-aff9-ba0ed3e0c9b2"
                }
              }
            },
            "has_charges": {
              "value": true
            },
            "recharge_type": {
              "value": "formula"
            },
            "recharge_event": {
              "value": "dawn"
            },
            "max_charges_constant": {
              "value": 3
            },
            "recharges": {
              "value": {
                "system": "5e2024",
                "resource_id": "dice_roll",
                "stats": {
                  "dice_amount": {
                    "value": 1
                  },
                  "id": "7d84b77e-92fa-42f4-97bf-51ffb7d8c5fc"
                }
              }
            },
            "id": "76159dbb-6c38-420b-a6b8-3a8c718d79f6"
          }
        }
      ]
    },
    "id": "d5bffdd4-f3d3-4b79-b591-67a6c101b7c5"
  }
}
