{
  "system": "5e2024",
  "resource_id": "item",
  "stats": {
    "name": {
      "value": "Portable Hole"
    },
    "source": {
      "value": "dmg"
    },
    "description": {
      "value": "This fine black cloth, soft as silk, is folded up to the dimensions of a handkerchief. It unfolds into a circular sheet 6 feet in diameter.\n\nYou can take a Magic action to unfold a Portable Hole and place it on or against a solid surface, whereupon the Portable Hole creates an extradimensional hole 10 feet deep. The cylindrical space within the hole exists on a different plane of existence, so it can't be used to create open passages. Any creature inside an open Portable Hole can exit the hole by climbing out of it.\n\nYou can take a Magic action to close a Portable Hole by taking hold of the edges of the cloth and folding it up. Folding the cloth closes the hole, and any creatures or objects within remain in the extradimensional space. No matter what's in it, the hole weighs next to nothing.\n\nIf the hole is folded up, a creature within the hole's extradimensional space can take an action to make a DC 10 Strength (Athletics) check. On a successful check, the creature forces its way out and appears within 5 feet of the Portable Hole. A closed Portable Hole holds enough air for 1 hour of breathing, divided by the number of breathing creatures inside.\n\nPlacing a Portable Hole inside an extradimensional space created by a Bag of Holding, Heward's Handy Haversack, or similar item instantly destroys both items and opens a gate to the Astral Plane. The gate originates where the one item was placed inside the other. Any creature within 10 feet of the gate and not behind Total Cover is sucked through it and deposited in a random location on the Astral Plane. The gate then closes. The gate is one-way only and can't be reopened"
    },
    "type": {
      "value": "wondrous"
    },
    "cost": {
      "value": {
        "system": "5e2024",
        "resource_id": "cost",
        "stats": {
          "unit": {
            "value": "gold"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.800689"
          },
          "id": "8b0f7483-d243-4c09-8a34-662f25460545"
        }
      }
    },
    "weight": {
      "value": {
        "system": "5e2024",
        "resource_id": "weight",
        "stats": {
          "unit": {
            "value": "pounds"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.800694"
          },
          "id": "8cb08890-175a-4d6d-bfcf-2de06ca631de"
        }
      }
    },
    "rarity": {
      "value": "rare"
    },
    "is_magic": {
      "value": true
    },
    "requires_attunement": {
      "value": false
    },
    "is_cursed": {
      "value": false
    },
    "is_intelligent": {
      "value": false
    },
    "is_spellcasting_focus": {
      "value": false
    },
    "effects": {
      "value": []
    },
    "updated_at": {
      "value": "2024-12-20T18:50:35.800697"
    },
    "id": "portable_hole"
  }
}
