{
  "system": "5e2024",
  "resource_id": "item",
  "stats": {
    "name": {
      "value": "Demonomicon of Iggwilv"
    },
    "source": {
      "value": "dmg"
    },
    "description": {
      "value": "This treatise, composed by Iggwilv the archmage, documents the Abyss's layers and inhabitants and is widely regarded as the most thorough and blasphemous tome of demonology in the multiverse. The tome recounts both the oldest and most current profanities of the Abyss and demons. Demons have attempted to censor the text, and while sections have been ripped from the book's spine, the general chapters remain, ever revealing demonic secrets. Caged behind lines of script roils a secret piece of the Abyss itself, which keeps the book up-to-date, no matter how many pages are removed, and it longs to be more than mere reference material.\n\nAbyssal Lore. You can reference the Demonomicon whenever you make an Intelligence check to discern information about demons or a Wisdom (Survival) check related to the Abyss. When you do so, you gain Advantage on the check.\n\nContainment. The first ten pages of the Demonomicon are blank. As a Magic action while holding the book, you can target a Fiend that you can see that is trapped within the area of a Magic Circle spell. The Fiend must succeed on a DC 20 Charisma saving throw with Disadvantage or become trapped within one of the Demonomicon's blank pages, which fills with writing detailing the trapped creature's widely known name and depravities. Once used, this action can't be used again until the next dawn.\n\nWhen you finish a Long Rest, if you and the Demonomicon are on the same plane of existence, one trapped creature within the book can attempt to possess you. You make a DC 20 Charisma saving throw. On a failed save, you are possessed by the creature, which controls you like a puppet. As a Magic action, the possessing creature can release you and appear in the closest unoccupied space to you. On a successful save, the Fiend can't try to possess you again for 7 days (but another Fiend trapped in the book can certainly try).\n\nWhen the tome is discovered, it has 1d4 Fiends occupying its pages—typically an assortment of demons.\n\nEnsnarement. While carrying the book, whenever you cast Magic Circle naming only Fiends or cast Planar Binding targeting a Fiend, the spell is cast at level 9, regardless of what level spell slot you used, if any. Additionally, the Fiend has Disadvantage on its saving throw against the spell.\n\nFiendish Scourging. While carrying the book, when you make a damage roll for a spell you cast against a Fiend, you use the maximum possible result instead of rolling.\n\nRandom Properties. The Artifact has the following random properties:\n\n- 2 minor beneficial properties\n- 1 minor detrimental property\n- 1 major detrimental property\n\nSpells. The book has 8 charges and regains 1d8 expended charges daily at dawn. While holding the book, you can take a Magic action to cast one of the spells (save DC 20) on the following table. The table indicates how many charges you must expend to cast the spell.\n\nSpell --> Charge Cost\nMagic Circle --> 1\nMagic Jar --> 3\nPlanar Ally --> 3\nPlanar Binding --> 2\nPlane Shift (to the Abyss only) --> 3\nSummon Fiend --> 3\nTasha's Hideous Laughter --> 0\n\nDestroying the Demonomicon. To destroy the book, six different demon lords must each tear out a sixth of the book's pages. If this occurs, the pages reappear after 24 hours. Before all those hours pass, anyone who opens the book's remaining binding is transported to a nascent layer of the Abyss that lies hidden within the book. At the heart of this deadly, semisentient domain lies a long-lost Artifact, Fraz-Urb'luu's Staff. If the staff is dragged from the pocket plane, the tome is reduced to a mundane and out-of-date copy of the Tome of Zyx, the work that served as the foundation of the Demonomicon of Iggwilv. The Tome of Zyx can be destroyed like any ordinary book. Once the staff emerges, the demon lord Fraz-Urb'luu knows instantly"
    },
    "type": {
      "value": "wondrous"
    },
    "cost": {
      "value": {
        "system": "5e2024",
        "resource_id": "cost",
        "stats": {
          "id": "4c961adb-383a-4f1d-a1b2-7e73308ffa33"
        }
      }
    },
    "weight": {
      "value": {
        "system": "5e2024",
        "resource_id": "weight",
        "stats": {
          "id": "0a07efab-c47a-4579-8c75-0c7ae66bce0b"
        }
      }
    },
    "rarity": {
      "value": "artifact"
    },
    "is_magic": {
      "value": true
    },
    "requires_attunement": {
      "value": true
    },
    "effects": {
      "value": [
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Charges"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "7f19ffec-144b-4477-a8fd-f970880d6ca4"
                }
              }
            },
            "has_charges": {
              "value": true
            },
            "recharge_type": {
              "value": "formula"
            },
            "recharge_event": {
              "value": "dawn"
            },
            "max_charges_constant": {
              "value": 8
            },
            "recharges": {
              "value": {
                "system": "5e2024",
                "resource_id": "dice_roll",
                "stats": {
                  "dice_amount": {
                    "value": 1
                  },
                  "dice_type": {
                    "value": "d8"
                  },
                  "id": "af7dee74-d51a-427f-a335-ba540e4f8453"
                }
              }
            },
            "id": "20a519a2-becf-4e09-95d2-ccfaa1c9444c"
          }
        },
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Cast magic circle (1 charge)"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "c34dd065-382b-4ac5-ac09-b31e089c25c7"
                }
              }
            },
            "type": {
              "value": "use_spell"
            },
            "spell": {
              "value": {
                "system": "5e2024",
                "resource_id": "spell",
                "stats": {
                  "name": {
                    "value": "Magic Circle"
                  },
                  "source": {
                    "value": "phb"
                  },
                  "level": {
                    "value": "spell_level_3"
                  },
                  "casting_time": {
                    "value": "1 minute"
                  },
                  "range": {
                    "value": "10 feet"
                  },
                  "duration": {
                    "value": "1 hour"
                  },
                  "verbal": {
                    "value": true
                  },
                  "somatic": {
                    "value": true
                  },
                  "material": {
                    "value": true
                  },
                  "components": {
                    "value": "salt and powdered silver worth 100+ GP, which the spell consumes"
                  },
                  "description": {
                    "value": "You create a 10-foot-radius, 20-foot-tall Cylinder of magical energy centered on a point on the ground that you can see within range. Glowing runes appear wherever the Cylinder intersects with the floor or other surface.\n\nChoose one or more of the following types of creatures: Celestials, Elementals, Fey, Fiends, or Undead. The circle affects a creature of the chosen type in the following ways:\n\n- The creature can't willingly enter the Cylinder by nonmagical means. If the creature tries to use teleportation or interplanar travel to do so, it must first succeed on a Charisma saving throw.\n- The creature has Disadvantage on attack rolls against targets within the Cylinder.\n- Targets within the Cylinder can't be possessed by or gain the Charmed or Frightened condition from the creature.\n\nEach time you cast this spell, you can cause its magic to operate in the reverse direction, preventing a creature of the specified type from leaving the Cylinder and protecting targets outside it"
                  },
                  "higher_level_description": {
                    "value": "When you cast this spell using a spell slot of 4th level or higher, the duration increases by 1 hour for each slot level above 3rd."
                  },
                  "classes": {
                    "value": [
                      "cleric",
                      "paladin",
                      "warlock",
                      "fighter",
                      "rogue",
                      "wizard"
                    ]
                  },
                  "dice": {
                    "value": []
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:46.633227"
                  },
                  "id": "c674961d-4379-432a-989c-aee13eb88b71"
                }
              }
            },
            "id": "8948b594-a5a3-4a85-9306-f83207155f08"
          }
        },
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Cast magic jar (3 charges)"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "4ea37bcf-239f-4f96-a892-fdb6b91e93e2"
                }
              }
            },
            "type": {
              "value": "use_spell"
            },
            "spell": {
              "value": {
                "system": "5e2024",
                "resource_id": "spell",
                "stats": {
                  "name": {
                    "value": "Magic Jar"
                  },
                  "source": {
                    "value": "phb"
                  },
                  "level": {
                    "value": "spell_level_6"
                  },
                  "school": {
                    "value": "spell_school_necromancy"
                  },
                  "casting_time": {
                    "value": "1 minute"
                  },
                  "range": {
                    "value": "Self"
                  },
                  "duration": {
                    "value": "Until dispelled"
                  },
                  "verbal": {
                    "value": true
                  },
                  "somatic": {
                    "value": true
                  },
                  "material": {
                    "value": true
                  },
                  "components": {
                    "value": "a gem, crystal, or reliquary worth 500+ GP"
                  },
                  "description": {
                    "value": "Your body falls into a catatonic state as your soul leaves it and enters the container you used for the spell's Material component. While your soul inhabits the container, you are aware of your surroundings as if you were in the container's space. You can't move or take Reactions. The only action you can take is to project your soul up to 100 feet out of the container, either returning to your living body (and ending the spell) or attempting to possess a Humanoid's body.\n\nYou can attempt to possess any Humanoid within 100 feet of you that you can see (creatures warded by a Protection from Evil and Good or Magic Circle spell can't be possessed). The target makes a Charisma saving throw. On a failed save, your soul enters the target's body, and the target's soul becomes trapped in the container. On a successful save, the target resists your efforts to possess it, and you can't attempt to possess it again for 24 hours.\n\nOnce you possess a creature's body, you control it. Your Hit Points, Hit Point Dice, Strength, Dexterity, Constitution, Speed, and senses are replaced by the creature's. You otherwise keep your game statistics.\n\nMeanwhile, the possessed creature's soul can perceive from the container using its own senses, but it can't move and it is Incapacitated.\n\nWhile possessing a body, you can take a Magic action to return from the host body to the container if it is within 100 feet of you, returning the host creature's soul to its body. If the host body dies while you're in it, the creature dies, and you make a Charisma saving throw against your own spellcasting DC. On a success, you return to the container if it is within 100 feet of you. Otherwise, you die.\n\nIf the container is destroyed or the spell ends, your soul returns to your body. If your body is more than 100 feet away from you or if your body is dead, you die. If another creature's soul is in the container when it is destroyed, the creature's soul returns to its body if the body is alive and within 100 feet. Otherwise, that creature dies.\n\nWhen the spell ends, the container is destroyed"
                  },
                  "classes": {
                    "value": [
                      "wizard"
                    ]
                  },
                  "dice": {
                    "value": []
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:46.658100"
                  },
                  "id": "a6e4eec3-35e9-461e-95e5-1b2d167fae74"
                }
              }
            },
            "id": "54e0cec3-44a9-4d32-a259-bb1d2608f1a8"
          }
        },
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Cast planar ally (3 charges)"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "265b0daa-e84e-45c9-9a0d-ce161053d892"
                }
              }
            },
            "type": {
              "value": "use_spell"
            },
            "spell": {
              "value": {
                "system": "5e2024",
                "resource_id": "spell",
                "stats": {
                  "name": {
                    "value": "Planar Ally"
                  },
                  "source": {
                    "value": "phb"
                  },
                  "level": {
                    "value": "spell_level_6"
                  },
                  "school": {
                    "value": "spell_school_conjuration"
                  },
                  "casting_time": {
                    "value": "10 minutes"
                  },
                  "range": {
                    "value": "60 feet"
                  },
                  "duration": {
                    "value": "Instantaneous"
                  },
                  "verbal": {
                    "value": true
                  },
                  "somatic": {
                    "value": true
                  },
                  "description": {
                    "value": "You beseech an otherworldly entity for aid. The being must be known to you: a god, a demon prince, or some other being of cosmic power. That entity sends a Celestial, an Elemental, or a Fiend loyal to it to aid you, making the creature appear in an unoccupied space within range. If you know a specific creature's name, you can speak that name when you cast this spell to request that creature, though you might get a different creature anyway (DM's choice).\n\nWhen the creature appears, it is under no compulsion to behave a particular way. You can ask it to perform a service in exchange for payment, but it isn't obliged to do so. The requested task could range from simple (fly us across the chasm, or help us fight a battle) to complex (spy on our enemies, or protect us during our foray into the dungeon). You must be able to communicate with the creature to bargain for its services.\n\nPayment can take a variety of forms. A Celestial might require a sizable donation of gold or magic items to an allied temple, while a Fiend might demand a living sacrifice or a gift of treasure. Some creatures might exchange their service for a quest undertaken by you.\n\nA task that can be measured in minutes requires a payment worth 100 GP per minute. A task measured in hours requires 1,000 GP per hour. And a task measured in days (up to 10 days) requires 10,000 GP per day. The DM can adjust these payments based on the circumstances under which you cast the spell. If the task is aligned with the creature's ethos, the payment might be halved or even waived. Nonhazardous tasks typically require only half the suggested payment, while especially dangerous tasks might require a greater gift. Creatures rarely accept tasks that seem suicidal.\n\nAfter the creature completes the task, or when the agreed-upon duration of service expires, the creature returns to its home plane after reporting back to you if possible. If you are unable to agree on a price for the creature's service, the creature immediately returns to its home plane"
                  },
                  "classes": {
                    "value": [
                      "cleric"
                    ]
                  },
                  "dice": {
                    "value": []
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:46.661651"
                  },
                  "id": "44b74b22-8f39-4731-b2d8-6d992a5f363d"
                }
              }
            },
            "id": "fefef0b8-75e1-4d93-9be9-5ab6f07b7a41"
          }
        },
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Cast planar binding (2 charges)"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "d007e92c-10df-41da-add1-a36fe8eaf61e"
                }
              }
            },
            "type": {
              "value": "use_spell"
            },
            "spell": {
              "value": {
                "system": "5e2024",
                "resource_id": "spell",
                "stats": {
                  "name": {
                    "value": "Planar Binding"
                  },
                  "source": {
                    "value": "phb"
                  },
                  "level": {
                    "value": "spell_level_5"
                  },
                  "casting_time": {
                    "value": "1 hour"
                  },
                  "range": {
                    "value": "60 feet"
                  },
                  "duration": {
                    "value": "24 hours"
                  },
                  "verbal": {
                    "value": true
                  },
                  "somatic": {
                    "value": true
                  },
                  "material": {
                    "value": true
                  },
                  "components": {
                    "value": "a jewel worth at least 1,000 gp, which the spell consumes"
                  },
                  "description": {
                    "value": "You attempt to bind a Celestial, an Elemental, a Fey, or a Fiend to your service. The creature must be within range for the entire casting of the spell. (Typically, the creature is first summoned into the center of the inverted version of the Magic Circle spell to trap it while this spell is cast.) At the completion of the casting, the target must succeed on a Charisma saving throw or be bound to serve you for the duration. If the creature was summoned or created by another spell, that spell's duration is extended to match the duration of this spell.\n\nA bound creature must follow your commands to the best of its ability. You might command the creature to accompany you on an adventure, to guard a location, or to deliver a message. If the creature is Hostile, it strives to twist your commands to achieve its own objectives. If the creature carries out your commands completely before the spell ends, it travels to you to report this fact if you are on the same plane of existence. If you are on a different plane, it returns to the place where you bound it and remains there until the spell ends"
                  },
                  "higher_level_description": {
                    "value": "When you cast this spell using a spell slot of a higher level, the duration increases to 10 days with a 6th-level slot, to 30 days with a 7th-level slot, to 180 days with an 8th-level slot, and to a year and a day with a 9th-level spell slot."
                  },
                  "classes": {
                    "value": [
                      "bard",
                      "cleric",
                      "druid",
                      "wizard",
                      "warlock"
                    ]
                  },
                  "dice": {
                    "value": []
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:46.661785"
                  },
                  "id": "98f4087a-df75-4ac4-86b5-dbccb23f1fb5"
                }
              }
            },
            "id": "fb567121-ddd6-45fa-9e79-510ecd5eaef2"
          }
        },
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Cast plane shift (3 charges)"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "85c5988c-9440-409c-970e-d65935c9eca8"
                }
              }
            },
            "type": {
              "value": "use_spell"
            },
            "spell": {
              "value": {
                "system": "5e2024",
                "resource_id": "spell",
                "stats": {
                  "name": {
                    "value": "Plane Shift"
                  },
                  "source": {
                    "value": "phb"
                  },
                  "level": {
                    "value": "spell_level_7"
                  },
                  "school": {
                    "value": "spell_school_conjuration"
                  },
                  "casting_time": {
                    "value": "1 action"
                  },
                  "range": {
                    "value": "Touch"
                  },
                  "duration": {
                    "value": "Instantaneous"
                  },
                  "verbal": {
                    "value": true
                  },
                  "somatic": {
                    "value": true
                  },
                  "material": {
                    "value": true
                  },
                  "components": {
                    "value": "a forked, metal rod worth at least 250 gp, attuned to a particular plane of existence"
                  },
                  "description": {
                    "value": "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination, as determined by the DM.\n\nAlternatively, if you know the sigil sequence of a teleportation circle on another plane of existence, this spell can take you to that circle. If the teleportation circle is too small to hold all the creatures you transported, they appear in the closest unoccupied spaces next to the circle"
                  },
                  "classes": {
                    "value": [
                      "cleric",
                      "druid",
                      "sorcerer",
                      "warlock",
                      "wizard"
                    ]
                  },
                  "dice": {
                    "value": []
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:46.645254"
                  },
                  "id": "618c506b-4635-484f-b64f-5cf8bdc8e78d"
                }
              }
            },
            "id": "60905c61-ca95-434d-9d6c-127833f37974"
          }
        },
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Cast summon fiend (3 charges)"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "f135b15b-dc9e-4c46-982e-a55c0dedcf32"
                }
              }
            },
            "type": {
              "value": "use_spell"
            },
            "spell": {
              "value": {
                "system": "5e2024",
                "resource_id": "spell",
                "stats": {
                  "name": {
                    "value": "Summon Fiend"
                  },
                  "source": {
                    "value": "phb"
                  },
                  "level": {
                    "value": "spell_level_6"
                  },
                  "school": {
                    "value": "spell_school_conjuration"
                  },
                  "casting_time": {
                    "value": "1 action"
                  },
                  "range": {
                    "value": "90 feet"
                  },
                  "duration": {
                    "value": "Concentration, up to 1 hour"
                  },
                  "verbal": {
                    "value": true
                  },
                  "somatic": {
                    "value": true
                  },
                  "material": {
                    "value": true
                  },
                  "components": {
                    "value": "a bloody vial worth 600+ GP"
                  },
                  "description": {
                    "value": "You call forth a fiendish spirit. It manifests in an unoccupied space that you can see within range and uses the Fiendish Spirit stat block. When you cast the spell, choose Demon, Devil, or Yugoloth. The creature resembles a Fiend of the chosen type, which determines certain details in its stat block. The creature disappears when it drops to 0 Hit Points or when the spell ends.\n\nThe creature is an ally to you and your allies. In combat, the creature shares your Initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the Dodge action and uses its movement to avoid danger"
                  },
                  "higher_level_description": {
                    "value": "Use the spell slot's level for the spell's level in the stat block"
                  },
                  "classes": {
                    "value": [
                      "warlock",
                      "wizard"
                    ]
                  },
                  "dice": {
                    "value": []
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:46.697660"
                  },
                  "id": "cf15d706-b39f-43a5-a99e-8c9c297bbce3"
                }
              }
            },
            "id": "7ef68f96-8e5c-4cb8-a8a8-7ea9cd686a16"
          }
        },
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Cast tasha's hideous laughter (0 charges)"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "618730d6-78ce-4a1b-bd6c-a1ece4c4b942"
                }
              }
            },
            "type": {
              "value": "use_spell"
            },
            "spell": {
              "value": {
                "system": "5e2024",
                "resource_id": "spell",
                "stats": {
                  "name": {
                    "value": "Tasha's Hideous Laughter"
                  },
                  "source": {
                    "value": "phb"
                  },
                  "level": {
                    "value": "spell_level_1"
                  },
                  "school": {
                    "value": "spell_school_enchantment"
                  },
                  "casting_time": {
                    "value": "1 action"
                  },
                  "range": {
                    "value": "30 feet"
                  },
                  "duration": {
                    "value": "Concentration, up to 1 minute"
                  },
                  "verbal": {
                    "value": true
                  },
                  "somatic": {
                    "value": true
                  },
                  "material": {
                    "value": true
                  },
                  "components": {
                    "value": "a tart and a feather"
                  },
                  "description": {
                    "value": "One creature of your choice that you can see within range makes a Wisdom saving throw. On a failed save, it has the Prone and Incapacitated conditions for the duration. During that time, it laughs uncontrollably if it's capable of laughter, and it can't end the Prone condition on itself.\n\nAt the end of each of its turns and each time it takes damage, it makes another Wisdom saving throw. The target has Advantage on the save if the save is triggered by damage. On a successful save, the spell ends"
                  },
                  "higher_level_description": {
                    "value": "You can target one additional creature for each spell slot level about 1"
                  },
                  "classes": {
                    "value": [
                      "bard",
                      "fighter",
                      "rogue",
                      "wizard",
                      "warlock"
                    ]
                  },
                  "dice": {
                    "value": []
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:46.636934"
                  },
                  "id": "1e7205b5-43ec-4669-8371-367984d553d0"
                }
              }
            },
            "id": "77186fcc-2819-4b0f-b6f6-ff7c1d4bc4e3"
          }
        }
      ]
    },
    "id": "e5cc2e9d-d499-4b1d-b76e-15235891faa1"
  }
}
