{
  "system": "5e2024",
  "resource_id": "item",
  "stats": {
    "name": {
      "value": "Bag of Beans"
    },
    "source": {
      "value": "dmg"
    },
    "description": {
      "value": "This heavy cloth bag contains 3d4 dry beans when found. The bag weighs half a pound regardless of how many beans it contains and becomes a nonmagical item when it no longer contains any beans.\n\nIf you dump one or more beans out of the bag, they explode in a 10-foot-radius Sphere centered on them. All the dumped beans are destroyed in the explosion, and each creature in the Sphere, including you, makes a DC 15 Dexterity saving throw, taking 5d4 Force damage on a failed save or half as much damage on a successful one.\n\nIf you remove a bean from the bag, plant it in dirt or sand, and then water it, the bean disappears as it produces an effect 1 minute later from the ground where it was planted. The DM can choose an effect from the following table or determine it randomly.\n\n1d100 --> Effect\n01 --> 5d4 toadstools sprout. If a creature eats a toadstool, roll any die. On an odd roll, the eater must succeed on a DC 15 Constitution saving throw or take 5d6 Poison damage and have the Poisoned condition for 1 hour. On an even roll, the eater gains 5d6 Temporary Hit Points for 1 hour.\n02-10 --> A geyser erupts and spouts water, beer, mayonnaise, tea, vinegar, wine, or oil (DM's choice) 30 feet into the air for 1d4 minutes.\n11-20 --> A Treant sprouts. Roll any die. On an odd roll, the treant is Chaotic Evil. On an even roll, the treant is Chaotic Good.\n21-30 --> An animate but immobile stone statue in your likeness rises and makes verbal threats against you. If you leave it and others come near, it describes you as the most heinous of villains and directs the newcomers to find and attack you. If you are on the same plane of existence as the statue, it knows where you are. The statue becomes inanimate after 24 hours.\n31-40 --> A campfire with green flames springs forth and burns for 24 hours or until it is extinguished.\n41-50 --> Three Shrieker Fungi sprout.\n51-60 --> 1d4 + 4 bright-pink toads crawl forth. Whenever a toad is touched, it transforms into a Large or smaller monster of the DM's choice that acts in accordance with its alignment and nature. The monster remains for 1 minute, then disappears in a puff of bright-pink smoke.\n61-70 --> A hungry Bulette burrows up and attacks.\n71-80 --> A fruit tree grows. It has 1d10 + 20 fruit, 1d8 of which act as randomly determined potions. The tree vanishes after 1 hour. Picked fruit remains, retaining any magic for 30 days.\n81-90 --> A nest of 1d4 + 3 rainbow-colored eggs springs up. Any creature that eats an egg makes a DC 20 Constitution saving throw. On a successful save, a creature permanently increases its lowest ability score by 1, randomly choosing among equally low scores. On a failed save, the creature takes 10d6 Force damage from an internal explosion.\n91-95 --> A pyramid with a 60-foot-square base bursts upward. Inside is a burial chamber containing a Mummy, a Mummy Lord, or some other Undead of the DM's choice. Its sarcophagus contains treasure of the DM's choice.\n96-00 --> A giant beanstalk sprouts, growing to a height of the DM's choice. The top leads where the DM chooses, such as to a great view, a cloud giant's castle, or another plane of existence"
    },
    "type": {
      "value": "wondrous"
    },
    "cost": {
      "value": {
        "system": "5e2024",
        "resource_id": "cost",
        "stats": {
          "unit": {
            "value": "gold"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.636115"
          },
          "id": "70debb85-4e46-4502-a4a8-9b159e71b425"
        }
      }
    },
    "weight": {
      "value": {
        "system": "5e2024",
        "resource_id": "weight",
        "stats": {
          "value": {
            "value": 0
          },
          "unit": {
            "value": "ounces"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.636121"
          },
          "id": "6e79b2d6-0d04-4f89-b9a4-00d20b8824fd"
        }
      }
    },
    "rarity": {
      "value": "rare"
    },
    "is_magic": {
      "value": true
    },
    "requires_attunement": {
      "value": false
    },
    "is_cursed": {
      "value": false
    },
    "is_intelligent": {
      "value": false
    },
    "is_spellcasting_focus": {
      "value": false
    },
    "effects": {
      "value": []
    },
    "updated_at": {
      "value": "2024-12-20T18:50:35.636124"
    },
    "id": "bag_of_beans"
  }
}
