{
  "system": "5e2024",
  "resource_id": "item",
  "stats": {
    "name": {
      "value": "Oil"
    },
    "source": {
      "value": "phb"
    },
    "description": {
      "value": "You can douse a creature, object, or space with Oil or use it as fuel, as detailed below.\n\nDousing a Creature or an Object. When you take the Attack action, you can replace one of your attacks with throwing an Oil flask. Target one creature or object within 20 feet of yourself. The target must succeed on a Dexterity saving throw (DC 8 plus your Dexterity modifier and Proficiency Bonus) or be covered in oil. If the target takes Fire damage before the oil dries (after 1 minute), the target takes an extra 5 Fire damage from burning oil.\n\nDousing a Space. You can take the Utilize action to pour an Oil flask on level ground to cover a 5-foot-square area within 5 feet of yourself. If lit, the oil burns until the end of the turn 2 rounds from when the oil was lit (or 12 seconds) and deals 5 Fire damage to any creature that enters the area or ends its turn there. A creature can take this damage only once per turn.\n\nFuel. Oil serves as fuel for Lamps and Lanterns. Once lit, a flask of Oil burns for 6 hours in a Lamp or Lantern. That duration doesn't need to be consecutive; you can extinguish the burning Oil (as a Utilize action) and rekindle it again until it has burned for a total of 6 hours"
    },
    "type": {
      "value": "adventuring_gear"
    },
    "cost": {
      "value": {
        "system": "5e2024",
        "resource_id": "cost",
        "stats": {
          "value": {
            "value": 1.0
          },
          "unit": {
            "value": "silver"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.669311"
          },
          "id": "0d49f56e-25dd-455b-b416-dbea42b862c8"
        }
      }
    },
    "weight": {
      "value": {
        "system": "5e2024",
        "resource_id": "weight",
        "stats": {
          "value": {
            "value": 1
          },
          "unit": {
            "value": "pounds"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.669316"
          },
          "id": "0e020fc9-7e70-4e8a-bad9-b91454c8a801"
        }
      }
    },
    "rarity": {
      "value": "none"
    },
    "is_magic": {
      "value": false
    },
    "requires_attunement": {
      "value": false
    },
    "is_cursed": {
      "value": false
    },
    "is_intelligent": {
      "value": false
    },
    "is_spellcasting_focus": {
      "value": false
    },
    "effects": {
      "value": []
    },
    "updated_at": {
      "value": "2024-12-20T18:50:35.669319"
    },
    "id": "oil__flask_"
  }
}
