{
  "system": "5e2024",
  "resource_id": "item",
  "stats": {
    "name": {
      "value": "Bag of Holding"
    },
    "source": {
      "value": "dmg"
    },
    "description": {
      "value": "This bag has an interior space considerably larger than its outside dimensions—roughly 2 feet square and 4 feet deep on the inside. The bag can hold up to 500 pounds, not exceeding a volume of 64 cubic feet. The bag weighs 5 pounds, regardless of its contents. Retrieving an item from the bag requires a Utilize action.\n\nIf the bag is overloaded, pierced, or torn, it is destroyed, and its contents are scattered in the Astral Plane. If the bag is turned inside out, its contents spill forth unharmed, but the bag must be put right before it can be used again. The bag holds enough air for 10 minutes of breathing, divided by the number of breathing creatures inside.\n\nPlacing a Bag of Holding inside an extradimensional space created by a Heward's Handy Haversack, Portable Hole, or similar item instantly destroys both items and opens a gate to the Astral Plane. The gate originates where the one item was placed inside the other. Any creature within a 10-foot-radius Sphere centered on the gate is sucked through it to a random location on the Astral Plane. The gate then closes. The gate is one-way and can't be reopened"
    },
    "type": {
      "value": "wondrous"
    },
    "cost": {
      "value": {
        "system": "5e2024",
        "resource_id": "cost",
        "stats": {
          "unit": {
            "value": "gold"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.627729"
          },
          "id": "109b0d31-701c-429f-902b-e339d2648a2f"
        }
      }
    },
    "weight": {
      "value": {
        "system": "5e2024",
        "resource_id": "weight",
        "stats": {
          "value": {
            "value": 5
          },
          "unit": {
            "value": "pounds"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.627735"
          },
          "id": "4e184980-84a2-41d3-803d-5b3739c68176"
        }
      }
    },
    "rarity": {
      "value": "uncommon"
    },
    "is_magic": {
      "value": true
    },
    "requires_attunement": {
      "value": false
    },
    "is_cursed": {
      "value": false
    },
    "is_intelligent": {
      "value": false
    },
    "is_spellcasting_focus": {
      "value": false
    },
    "effects": {
      "value": []
    },
    "updated_at": {
      "value": "2024-12-20T18:50:35.627738"
    },
    "id": "bag_of_holding"
  }
}
