{
  "system": "5e2024",
  "resource_id": "item",
  "stats": {
    "name": {
      "value": "Spell Scroll (Level 1)"
    },
    "source": {
      "value": "dmg"
    },
    "description": {
      "value": "A Spell Scroll bears the words of a single spell, written in a mystical cipher. If the spell is on your spell list, you can read the scroll and cast its spell without Material components. Otherwise, the scroll is unintelligible. Casting the spell by reading the scroll requires the spell's normal casting time. Once the spell is cast, the scroll crumbles to dust. If the casting is interrupted, the scroll isn't lost.\n\nIf the spell is on your spell list but of a higher level than you can normally cast, you make a DC 11 ability check using your spellcasting ability to determine whether you cast the spell. On a failed check, the spell disappears from the scroll with no other effect.\n\nIf the spell requires a saving throw or an attack roll, the spell save DC is 13, and the attack bonus is +5.\n\nCopying a Scroll into a Spellbook. A Wizard spell on a Spell Scroll can be copied into a spellbook. When a level 1 spell is copied in this way, the copier must succeed on a DC 11 Intelligence (Arcana). On a successful check, the spell is copied. Whether the check succeeds or fails, the Spell Scroll is destroyed"
    },
    "type": {
      "value": "scroll"
    },
    "cost": {
      "value": {
        "system": "5e2024",
        "resource_id": "cost",
        "stats": {
          "value": {
            "value": 50
          },
          "unit": {
            "value": "gold"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.616994"
          },
          "id": "c1a860ac-9d5f-44dd-bc37-b854b9289ad0"
        }
      }
    },
    "weight": {
      "value": {
        "system": "5e2024",
        "resource_id": "weight",
        "stats": {
          "unit": {
            "value": "pounds"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.617000"
          },
          "id": "dea84fdb-634a-421c-a440-b5ad12eb15c5"
        }
      }
    },
    "rarity": {
      "value": "common"
    },
    "is_magic": {
      "value": true
    },
    "requires_attunement": {
      "value": false
    },
    "is_cursed": {
      "value": false
    },
    "is_intelligent": {
      "value": false
    },
    "is_spellcasting_focus": {
      "value": false
    },
    "effects": {
      "value": []
    },
    "updated_at": {
      "value": "2024-12-20T18:50:35.617003"
    },
    "id": "spell_scroll__1st_level_"
  }
}
