{
  "system": "5e2024",
  "resource_id": "item",
  "stats": {
    "name": {
      "value": "Sphere of Annihilation"
    },
    "source": {
      "value": "dmg"
    },
    "description": {
      "value": "This 2-foot-diameter black sphere is a hole in the multiverse, hovering in space and stabilized by a magical field surrounding it.\n\nThe sphere obliterates all matter it passes through and all matter that passes through it. Artifacts are the exception. Unless an Artifact is susceptible to damage from a Sphere of Annihilation, it passes through the sphere unscathed. Anything else that touches the sphere but isn't wholly engulfed and obliterated by it takes 8d10 Force damage.\n\nControlling the Sphere. A Sphere of Annihilation is stationary until someone takes control of it. If you are within 60 feet of a sphere, you can take a Magic action to make a DC 25 Intelligence (Arcana) check. On a successful check, you control the sphere until the start of your next turn, and if it was under another creature's control, that creature loses control of the sphere. On a failed check, the sphere moves 10 feet toward you in a straight line.\n\nWhile in control of the sphere, you can take a Bonus Action to cause it to move in one direction of your choice, up to a number of feet equal to 5 times your Intelligence modifier (minimum 5 feet). Any creature whose space the sphere enters must succeed on a DC 19 Dexterity saving throw or be touched by it, taking 8d10 Force damage. A creature reduced to 0 Hit Points by this damage is obliterated, leaving its possessions behind but no other physical remains.\n\nSphere Interactions. If the sphere comes into contact with a planar portal (such as that created by the Gate spell) or an extradimensional space (such as that within a Portable Hole), the DM determines randomly what happens using the following table.\n\n1d100 --> Result\n01-50 --> The sphere is destroyed.\n51-85 --> The sphere moves through the portal or into the extradimensional space.\n86-00 --> A spatial rift sends the sphere and each creature and object within 180 feet of the sphere to a random plane of existence."
    },
    "type": {
      "value": "wondrous"
    },
    "cost": {
      "value": {
        "system": "5e2024",
        "resource_id": "cost",
        "stats": {
          "unit": {
            "value": "gold"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.649302"
          },
          "id": "363a6a39-b933-4b94-bf3b-c1d25290df23"
        }
      }
    },
    "weight": {
      "value": {
        "system": "5e2024",
        "resource_id": "weight",
        "stats": {
          "updated_at": {
            "value": "2024-12-20T18:50:35.649307"
          },
          "id": "3347d840-db0e-4cd3-8dc5-cd6ce68fb79f"
        }
      }
    },
    "rarity": {
      "value": "legendary"
    },
    "is_magic": {
      "value": true
    },
    "effects": {
      "value": []
    },
    "updated_at": {
      "value": "2024-12-20T18:50:35.649309"
    },
    "id": "sphere_of_annihilation"
  }
}
