{
  "system": "5e2024",
  "resource_id": "item",
  "stats": {
    "name": {
      "value": "Sailing Ship"
    },
    "source": {
      "value": "phb"
    },
    "description": {
      "value": "Speed: 2 mph\nCarrying Capacity: 100 tons cargo, 20 passengers\nCrew 20, AC 15, HP 300, Damage Threshold 15\n\nSpeed. A ship sailing against a strong wind moves at half speed. In a dead calm (no wind), waterborne ships can't move under sail and must be rowed. Keelboats and Rowboats are used on lakes and rivers. If going downstream, add the speed of the current (typically 3 miles per hour) to the speed of the vehicle. These vehicles can't be rowed against any significant current, but they can be pulled upstream by draft animals on the shores. A Rowboat can be carried and weighs 100 pounds.\n\nCrew. A ship larger than a Keelboat or Rowboat needs a crew of skilled hirelings (see \"Services\") to function. The minimum number of skilled hirelings needed to crew a ship depends on the type of ship.\n\nPassengers. The number of Small and Medium passengers the ship can accommodate using hammocks. A ship outfitted with private accommodations can carry one-fifth as many passengers. A passenger usually pays 5 SP per day for a hammock, but prices can vary from ship to ship. A small private cabin usually costs 2 GP per day.\n\nDamage Threshold. See the rules glossary.\n\nShip Repair. Repairs to a damaged ship can be made while the vessel is berthed. Repairing 1 Hit Point of damage requires 1 day and costs 20 GP for materials and labor. If the repairs are made in a location where supplies and skilled labor are abundant, such as a city shipyard, the repair time and cost are halved"
    },
    "type": {
      "value": "vehicle_water"
    },
    "cost": {
      "value": {
        "system": "5e2024",
        "resource_id": "cost",
        "stats": {
          "value": {
            "value": 1000.0
          },
          "unit": {
            "value": "platinum"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.744902"
          },
          "id": "467617ae-8a9a-4b63-8b37-889e5a0bb124"
        }
      }
    },
    "weight": {
      "value": {
        "system": "5e2024",
        "resource_id": "weight",
        "stats": {
          "unit": {
            "value": "pounds"
          },
          "updated_at": {
            "value": "2024-12-20T18:50:35.744907"
          },
          "id": "38f2ff6e-7f9a-470c-bd23-bf9bf22351f2"
        }
      }
    },
    "rarity": {
      "value": "none"
    },
    "is_magic": {
      "value": false
    },
    "requires_attunement": {
      "value": false
    },
    "is_cursed": {
      "value": false
    },
    "is_intelligent": {
      "value": false
    },
    "is_spellcasting_focus": {
      "value": false
    },
    "effects": {
      "value": []
    },
    "updated_at": {
      "value": "2024-12-20T18:50:35.744909"
    },
    "id": "sailing_ship"
  }
}
