{
  "system": "5e2024",
  "resource_id": "weapon",
  "stats": {
    "name": {
      "value": "Blackrazor"
    },
    "source": {
      "value": "dmg"
    },
    "mastery": {
      "value": "graze"
    },
    "description": {
      "value": "Hidden in the dungeon of White Plume Mountain, Blackrazor shines like a piece of night sky filled with stars. Its black scabbard is decorated with pieces of cut obsidian.\n\nYou gain a +3 bonus to attack rolls and damage rolls made with this magic weapon. If you hit an Undead with this weapon, you take 1d10 Necrotic damage, and the target regains 1d10 Hit Points. If this Necrotic damage reduces you to 0 Hit Points, Blackrazor devours your soul (see \"Devour Soul\" below).\n\nWhile you hold this weapon, you have Immunity to the Charmed and Frightened conditions, and you have Blindsight with a range of 30 feet.\n\nDevour Soul. Whenever you use Blackrazor to reduce a creature to 0 Hit Points, the sword slays the creature and devours its soul unless it is a Construct or an Undead. A creature whose soul has been devoured by Blackrazor can be restored to life only by a Wish spell.\n\nWhen Blackrazor devours a soul that isn't yours, you gain Temporary Hit Points equal to the slain creature's Hit Point maximum.\n\nHaste. Blackrazor can cast Haste on you, after which it can't cast this spell again until the next dawn. Blackrazor decides when to cast the spell, which takes effect at the start of your turn. The spell lasts for 1 minute (no Concentration required) or until Blackrazor decides to end it, which it can do at the end of any of your turns.\n\nSentience. Blackrazor is a sentient Chaotic Neutral weapon with an Intelligence of 17, a Wisdom of 10, and a Charisma of 19. It has hearing and Darkvision out to 120 feet.\n\nThe weapon speaks Common and can communicate with its wielder telepathically. Its voice is deep and echoing. While you are attuned to it, Blackrazor also understands every language you know.\n\nPersonality. Blackrazor speaks with an imperious tone, as though accustomed to being obeyed.The sword's purpose is to consume souls. It doesn't care whose souls it eats, including the wielder's. The sword believes that all matter and energy sprang from a void of negative energy and will one day return to it. Blackrazor is meant to hurry that process along.\n\nDespite its nihilism, Blackrazor feels a strange kinship to Wave and Whelm, two other weapons locked away under White Plume Mountain. It wants the three weapons to be reunited and wielded together in combat, even though it violently disagrees with Whelm and finds Wave tedious.\n\nBlackrazor's hunger for souls must be regularly fed. If the sword goes 3 days or more without consuming a soul, a conflict between it and its wielder occurs at the next sunset.\n\nDestroying Blackrazor. Blackrazor can be destroyed by crushing it in the great gears of Mechanus. Primus, the creator of the modrons, also knows a series of musical tones that Blackrazor can't stand to hear, causing the sword to shatter.\n\nMastery: Graze. If your attack roll with this weapon misses a creature, you can deal damage to that creature equal to the ability modifier you used to make the attack roll. This damage is the same type dealt by the weapon, and the damage can be increased only by increasing the ability modifier"
    },
    "cost": {
      "value": {
        "system": "5e2024",
        "resource_id": "cost",
        "stats": {
          "id": "e587a2cb-975c-47f4-9113-53fb0461c86d"
        }
      }
    },
    "weight": {
      "value": {
        "system": "5e2024",
        "resource_id": "weight",
        "stats": {
          "value": {
            "value": 6
          },
          "id": "f68b9731-fdb0-4b69-a2c8-e931439f9fff"
        }
      }
    },
    "type": {
      "value": "greatsword"
    },
    "rarity": {
      "value": "legendary"
    },
    "requires_attunement": {
      "value": true
    },
    "is_simple": {
      "value": false
    },
    "is_two_handed": {
      "value": true
    },
    "is_heavy": {
      "value": true
    },
    "extra_attack_bonus": {
      "value": 3
    },
    "damage_dice": {
      "value": [
        {
          "system": "5e2024",
          "resource_id": "damage_dice",
          "stats": {
            "dices": {
              "value": [
                {
                  "system": "5e2024",
                  "resource_id": "dice_roll",
                  "stats": {
                    "dice_amount": {
                      "value": 2
                    },
                    "dice_type": {
                      "value": "d6"
                    },
                    "constant": {
                      "value": 3
                    },
                    "id": "bf306d48-f835-4d36-9b0a-880c06cdd8e9"
                  }
                }
              ]
            },
            "damage_type": {
              "value": "slashing"
            },
            "id": "7addb2df-c33c-4b17-8934-a080ba96b4df"
          }
        }
      ]
    },
    "effects": {
      "value": [
        {
          "system": "5e2024",
          "resource_id": "effect",
          "stats": {
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "system": "5e2024",
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "1d255c3d-adb8-4015-985b-6324dc3b7aae"
                }
              }
            },
            "has_charges": {
              "value": true
            },
            "recharge_event": {
              "value": "dawn"
            },
            "max_charges_constant": {
              "value": 1
            },
            "type": {
              "value": "use_spell"
            },
            "spell": {
              "value": {
                "system": "5e2024",
                "resource_id": "spell",
                "stats": {
                  "name": {
                    "value": "Haste"
                  },
                  "source": {
                    "value": "phb"
                  },
                  "level": {
                    "value": "spell_level_3"
                  },
                  "school": {
                    "value": "spell_school_transmutation"
                  },
                  "casting_time": {
                    "value": "1 action"
                  },
                  "range": {
                    "value": "30 feet"
                  },
                  "duration": {
                    "value": "Concentration, up to 1 minute"
                  },
                  "verbal": {
                    "value": true
                  },
                  "somatic": {
                    "value": true
                  },
                  "material": {
                    "value": true
                  },
                  "components": {
                    "value": "a shaving of licorice root"
                  },
                  "description": {
                    "value": "Choose a willing creature that you can see within range. Until the spell ends, the target's Speed is doubled, it gains a +2 bonus to Armor Class, it has Advantage on Dexterity saving throws, and it gains an additional action on each of its turns. That action can be used to take only the Attack (one attack only), Dash, Disengage, Hide, or Utilize action.\n\nWhen the spell ends, the target is Incapacitated and has a Speed of 0 until the end of its next turn, as a wave of lethargy washes over it"
                  },
                  "classes": {
                    "value": [
                      "sorcerer",
                      "fighter",
                      "rogue",
                      "wizard"
                    ]
                  },
                  "dice": {
                    "value": []
                  },
                  "updated_at": {
                    "value": "2024-12-20T18:50:46.632677"
                  },
                  "id": "0affcfea-0529-4712-8d07-64432cc699c8"
                }
              }
            },
            "id": "a6604440-23cc-49d1-aad7-dbf97f99e106"
          }
        }
      ]
    },
    "id": "f0f03f67-628f-4580-bd02-aac0d35a37ab"
  }
}
