{
  "system": "5e2024",
  "resource_id": "weapon",
  "stats": {
    "name": {
      "value": "Staff of Thunder and Lightning"
    },
    "source": {
      "value": "dmg"
    },
    "mastery": {
      "value": "topple"
    },
    "description": {
      "value": "This staff can be wielded as a magic Quarterstaff that grants a +2 bonus to attack rolls and damage rolls made with it. It also has the following additional properties. Once one of these properties is used, it can't be used again until the next dawn.\n\nLightning. When you hit with a melee attack using the staff, you can cause the target to take an extra 2d6 Lightning damage (no action required).\n\nThunder. When you hit with a melee attack using the staff, you can cause the staff to emit a crack of thunder audible out to 300 feet (no action required). The target you hit must succeed on a DC 17 Constitution saving throw or have the Stunned condition until the end of your next turn.\n\nThunder and Lightning. Immediately after you hit with a melee attack using the staff, you can take a Bonus Action to use the Lightning and Thunder properties (see above) at the same time. Doing so doesn't expend the daily use of those properties, only the use of this one.\n\nLightning Strike. You can take a Magic action to cause a bolt of lightning to leap from the staff's tip in a Line that is 5 feet wide and 120 feet long. Each creature in that Line makes a DC 17 Dexterity saving throw, taking 9d6 Lightning damage on a failed save or half as much damage on a successful one.\n\nThunderclap. You can take a Magic action to cause the staff to produce a thunderclap audible out to 600 feet. Every creature within a 60-foot Emanation originating from you makes a DC 17 Constitution saving throw. On a failed save, a creature takes 2d6 Thunder damage and has the Deafened condition for 1 minute. On a successful save, a creature takes half as much damage only.\n\nMastery: Topple. If you hit a creature with this weapon, you can force the creature to make a Constitution saving throw (DC 8 plus the ability modifier used to make the attack roll and your Proficiency Bonus). On a failed save, the creature has the Prone condition"
    },
    "cost": {
      "value": {
        "system": "5e2024",
        "resource_id": "cost",
        "stats": {
          "unit": {
            "value": "gold"
          },
          "id": "bb1b415c-68fb-438b-a2f4-d12f5838fcc6"
        }
      }
    },
    "weight": {
      "value": {
        "system": "5e2024",
        "resource_id": "weight",
        "stats": {
          "value": {
            "value": 4
          },
          "id": "cf64dee1-70d9-4b22-91b3-ba9670875589"
        }
      }
    },
    "type": {
      "value": "quarterstaff"
    },
    "rarity": {
      "value": "very_rare"
    },
    "requires_attunement": {
      "value": true
    },
    "extra_attack_bonus": {
      "value": 2
    },
    "damage_dice": {
      "value": [
        {
          "system": "5e2024",
          "resource_id": "damage_dice",
          "stats": {
            "dices": {
              "value": [
                {
                  "system": "5e2024",
                  "resource_id": "dice_roll",
                  "stats": {
                    "dice_amount": {
                      "value": 1
                    },
                    "dice_type": {
                      "value": "d6"
                    },
                    "constant": {
                      "value": 2
                    },
                    "id": "3ad5931d-7fdf-42c5-8ccd-82692f2d8b04"
                  }
                }
              ]
            },
            "damage_type": {
              "value": "bludgeoning"
            },
            "id": "cb931472-cbec-44cd-9d17-a1e00811471f"
          }
        }
      ]
    },
    "is_versatile": {
      "value": true
    },
    "versatile_damage_dice": {
      "value": [
        {
          "system": "5e2024",
          "resource_id": "damage_dice",
          "stats": {
            "dices": {
              "value": [
                {
                  "system": "5e2024",
                  "resource_id": "dice_roll",
                  "stats": {
                    "dice_amount": {
                      "value": 1
                    },
                    "dice_type": {
                      "value": "d8"
                    },
                    "constant": {
                      "value": 2
                    },
                    "id": "773385f1-6324-465c-bde7-57a9442ea082"
                  }
                }
              ]
            },
            "damage_type": {
              "value": "bludgeoning"
            },
            "id": "c74ade63-575d-4ba8-bf5d-c047223455a5"
          }
        }
      ]
    },
    "effects": {
      "value": []
    },
    "id": "a9d55b04-d8ef-4b43-ba9d-e5efffffcdf9"
  }
}
