{
  "resource_id": "armor",
  "stats": {
    "name": {
      "value": "Powered Armor"
    },
    "source": {
      "value": "qftis"
    },
    "description": {
      "value": "This suit of technologically advanced plate armor includes an under-suit that can fully seal, a helmet with a full face mask and crystal lenses in the eyeholes, and a set of gauntlets. The armor is powered by an energy cell stored in a compartment on the thigh plate.\n\nPlacing a full energy cell in the armor gives the armor 24 charges. A suit of powered armor functions as a suit of normal plate armor, even when it has 0 charges remaining.\n\nActivating the Armor. As an action, you can expend any number of the armor's charges to activate it; the armor remains active for 1 hour per charge expended. You can use a bonus action to deactivate the armor early, but doing so doesn't recover any expended charges.\n\nWhile the armor is active, you gain the following benefits:\n\nAugmented Physicality. You have advantage on Strength checks, and your carrying capacity is doubled.\n\nEnvironmental Adaptation. The armor seals airtight and provides its own atmosphere. You can breathe normally in any environment and withstand extreme temperatures, and you're unaffected by harmful gases, as well as contact and inhaled poisons.\n\nForce Field. When you would take damage, you can use your reaction to expend 1 of the armor's charges to deploy a defensive force field. Roll 3d10 and reduce the damage taken by the total rolled.\n\nPropulsion. As a bonus action, you can expend 1 of the armor's charges to gain a flying speed equal to your walking speed for 1 minute. If you're airborne when this duration ends, you fall.\n\nReplacing the Energy Cell. While the armor has charges remaining, its energy cell can't be removed. Once the armor has 0 charges, you can replace the energy cell with a new cell by using an action or a bonus action"
    },
    "cost": {
      "value": {
        "resource_id": "cost",
        "stats": {
          "id": "619ed135-38d6-4fd3-991c-3606b76ee577"
        }
      }
    },
    "weight": {
      "value": {
        "resource_id": "weight",
        "stats": {
          "id": "a187c9b4-2e03-4acf-b380-406e89c3a0ec"
        }
      }
    },
    "type": {
      "value": "heavy"
    },
    "impose_stealth_disadvantage": {
      "value": true
    },
    "base_ac": {
      "value": 18
    },
    "required_strength": {
      "value": 15
    },
    "effects": {
      "value": [
        {
          "resource_id": "effect",
          "stats": {
            "name": {
              "value": "Charges"
            },
            "trigger_type": {
              "value": "active"
            },
            "trigger_condition": {
              "value": {
                "resource_id": "trigger_condition_or",
                "stats": {
                  "id": "b998df13-f745-43d6-b395-d3755831c01f"
                }
              }
            },
            "has_charges": {
              "value": true
            },
            "recharge_event": {
              "value": "manual"
            },
            "max_charges_constant": {
              "value": 24
            },
            "id": "367a3971-482e-40c7-8c7d-2e2e1e7653b6"
          }
        }
      ]
    },
    "id": "5279d9f8-825d-4e44-a036-bb827c43d43f"
  }
}
