{"resource_id":"weapon","stats":{"name":{"value":"Blackrazor"},"source":{"value":"dmg"},"description":{"value":"(requires attunement by a creature of non-lawful alignment)\n\nYou gain a +3 bonus to attack and damage rolls made with this magic weapon. It has the following additional properties.\n\nDevour Soul. Whenever you use it to reduce a creature to 0 hit points, the sword slays the creature and devours its soul, unless it is a construct or an undead. A creature whose soul has been devoured by Blackrazor can be restored to life only by a wish spell.\n\nWhen it devours a soul, Blackrazor grants you temporary hit points equal to the slain creature's hit point maximum. These hit points fade after 24 hours. As long as these temporary hit points last and you keep Blackrazor in hand, you have advantage on attack rolls, saving throws, and ability checks.\n\nIf you hit an undead with this weapon, you take 1d10 necrotic damage and the target regains 1d10 hit points. If this necrotic damage reduces you to 0 hit points, Blackrazor devours your soul.\n\nSoul Hunter. While you hold the weapon. you are aware of the presence of Tiny or larger creatures within 60 feet of you that aren't constructs or undead. You also can't be charmed or frightened.\n\nBlackrazor can cast the haste spell on you once per day. It decides when to cast the spell and maintains concentration on it so that you don't have to.\n\nSentience. Blackrazor is a sentient chaotic neutral weapon with an Intelligence of 17, a Wisdom of 10, and a Charisma of 19. It has hearing and darkvision out to a range of 120 feet.\n\nThe weapon can speak, read, and understand Common, and can communicate with its wielder telepathically. Its voice is deep and echoing. While you are attuned to it, Blackrazor also understands every language you know.\n\nPersonality. Blackrazor speaks with an imperious tone, as though accustomed to being obeyed.\n\nThe sword's purpose is to consume souls. It doesn't care whose souls it eats, including the wielder's. The sword believes that all matter and energy sprang from a void of negative energy and will one day return to it. Blackrazor is meant to hurry that process along.\n\nDespite its nihilism, Blackrazor feels a strange kinship to Wave and Whelm, two other weapons locked away under White Plume Mountain. It wants the three weapons to be united again and wielded together in combat, even though it violently disagrees with Whelm and finds Wave tedious.\n\nBlackrazor's hunger for souls must be regularly fed. If the sword goes three days or more without consuming a soul, a conflict between it and its wielder occurs at the next sunset"},"cost":{"value":{"resource_id":"cost","stats":{"id":"e587a2cb-975c-47f4-9113-53fb0461c86d"}}},"weight":{"value":{"resource_id":"weight","stats":{"value":{"value":6},"id":"f68b9731-fdb0-4b69-a2c8-e931439f9fff"}}},"type":{"value":"greatsword"},"rarity":{"value":"legendary"},"requires_attunement":{"value":true},"is_simple":{"value":false},"is_two_handed":{"value":true},"is_heavy":{"value":true},"extra_attack_bonus":{"value":3},"damage_dice":{"value":[{"resource_id":"damage_dice","stats":{"dices":{"value":[{"resource_id":"dice_roll","stats":{"dice_amount":{"value":2},"dice_type":{"value":"d6"},"constant":{"value":3},"id":"bf306d48-f835-4d36-9b0a-880c06cdd8e9"}}]},"damage_type":{"value":"slashing"},"id":"7addb2df-c33c-4b17-8934-a080ba96b4df"}}]},"effects":{"value":[{"resource_id":"effect","stats":{"trigger_type":{"value":"active"},"trigger_condition":{"value":{"resource_id":"trigger_condition_or","stats":{"id":"1d255c3d-adb8-4015-985b-6324dc3b7aae"}}},"has_charges":{"value":true},"recharge_event":{"value":"dawn"},"max_charges_constant":{"value":1},"type":{"value":"use_spell"},"spell":{"value":{"resource_id":"spell","stats":{"name":{"value":"Haste"},"source":{"value":"phb"},"level":{"value":"spell_level_3"},"school":{"value":"spell_school_transmutation"},"casting_time":{"value":"1 action"},"range":{"value":"30 feet"},"duration":{"value":"Concentration, up to 1 minute"},"verbal":{"value":true},"somatic":{"value":true},"material":{"value":true},"components":{"value":"a shaving of licorice root"},"description":{"value":"Choose a willing creature that you can see within range. Until the spell ends, the target’s speed is doubled, it gains a +2 bonus to AC, it has advantage on Dexterity saving throws, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.\n\nWhen the spell ends, the target can’t move or take actions until after its next turn, as a wave of lethargy sweeps over it."},"classes":{"value":["artificer","artificer__eb_","artificer__revised_","sorcerer","fighter","rogue","wizard"]},"dice":{"value":[]},"updated_at":{"value":"2024-12-20T18:50:46.632677"},"id":"924f819a-b0ad-4da3-bc59-f8bc3894c30e"}}},"id":"a6604440-23cc-49d1-aad7-dbf97f99e106"}}]},"id":"f0f03f67-628f-4580-bd02-aac0d35a37ab"}}