{"resource_id":"weapon","stats":{"name":{"value":"Dekella, Bident of Thassa"},"source":{"value":"mot"},"description":{"value":"Thassa wields Dekella, a two-pronged weapon gifted to her by Purphoros. When the god of the sea bestows her weapon on a mortal, it's often so they might work her will far from the ocean, right some wrong affecting those she'd prefer not to harm, or give a mortal a glimpse of her terrible responsibilities.\n\nBident of the Deep. Thassa's signature weapon thrums with the icy currents of the deep ocean. This weapon functions as a trident that grants a +3 bonus to attack and damage rolls made with it. When you hit with an attack using the bident, the target takes an extra 2d10 cold damage.\n\nBlessing of the Deep. If you are a worshiper of Thassa, you gain all the following benefits for which you have the required piety:\n\nPiety 10+. You can breathe underwater, and you gain a swimming speed of 60 feet.\n\nPiety 25+. The bident has 1 randomly determined minor beneficial property.\n\nPiety 50+. The bident has 1 randomly determined major beneficial property.\n\nIf you aren't a worshiper of Thassa, the bident has 1 minor detrimental property and 1 major detrimental property, both randomly determined.\n\nCommand the Deep. The bident holds the power to command the waves and its creatures. As an action, you can change the condition of the sea within 1 mile of you, creating strong winds and heavy rain that cause violent waves or calming a storm. In either case, the unnatural weather lasts for 1 hour before returning to normal. Once used, this property of the bident can't be used again until the next dusk.\n\nAdditionally, you can cast the dominate monster spell (save DC 18) from the bident, but only on beasts and monstrosities that have an innate swimming speed. Once used, this property of the bident can't be used again until the next dusk.\n\nAquatic Metamorphosis. You can cast the true polymorph spell (save DC 18) from the bident, but you must cast it on a creature to turn it into a kind of creature that has an innate swimming speed. Once used, this property of the bident can't be used again until the next dusk.\n\nDestroying the Bident. To destroy the bident, it must be heated by the breath of an ancient red dragon and then, while still hot, immersed in the Tartyx River"},"cost":{"value":{"resource_id":"cost","stats":{"id":"129983bf-9333-400e-9112-10ec415fcbbf"}}},"weight":{"value":{"resource_id":"weight","stats":{"value":{"value":4},"id":"5a964fc5-3b60-42f7-a0c3-c885cac5890e"}}},"type":{"value":"trident"},"rarity":{"value":"artifact"},"requires_attunement":{"value":true},"is_simple":{"value":false},"is_thrown":{"value":true},"thrown_range":{"value":"20/60"},"extra_attack_bonus":{"value":3},"damage_dice":{"value":[{"resource_id":"damage_dice","stats":{"dices":{"value":[{"resource_id":"dice_roll","stats":{"dice_amount":{"value":1},"dice_type":{"value":"d6"},"constant":{"value":3},"id":"ba7a2ad8-c7a8-4251-b7da-aa9b7d0d6006"}}]},"damage_type":{"value":"piercing"},"id":"8fb767ab-ae93-428e-b5d1-a80fb3c450d8"}},{"resource_id":"damage_dice","stats":{"dices":{"value":[{"resource_id":"dice_roll","stats":{"dice_amount":{"value":2},"dice_type":{"value":"d10"},"id":"fad0b84b-4539-49b3-840b-9be33cd32eeb"}}]},"damage_type":{"value":"cold"},"id":"480ce846-9e69-49e5-8453-7055bd9678b0"}}]},"is_versatile":{"value":true},"versatile_damage_dice":{"value":[{"resource_id":"damage_dice","stats":{"dices":{"value":[{"resource_id":"dice_roll","stats":{"dice_amount":{"value":1},"dice_type":{"value":"d8"},"constant":{"value":3},"id":"5d0fad47-5892-46b5-be76-e4eed2d4f7c2"}}]},"damage_type":{"value":"piercing"},"id":"f634a8a1-d99f-41c2-82eb-404fb92ee592"}},{"resource_id":"damage_dice","stats":{"dices":{"value":[{"resource_id":"dice_roll","stats":{"dice_amount":{"value":2},"dice_type":{"value":"d10"},"id":"b5113012-28a4-438b-b287-044753af8b7d"}}]},"damage_type":{"value":"cold"},"id":"474a0f78-136c-4789-86ba-4e8d503ccb3d"}}]},"effects":{"value":[{"resource_id":"effect","stats":{"name":{"value":"Command sea"},"trigger_type":{"value":"active"},"trigger_condition":{"value":{"resource_id":"trigger_condition_or","stats":{"id":"47549139-e093-4a0a-a24a-49701550abf3"}}},"has_charges":{"value":true},"recharge_event":{"value":"dusk"},"max_charges_constant":{"value":1},"id":"1858de90-50aa-44e3-9a30-9854449f2a8e"}},{"resource_id":"effect","stats":{"name":{"value":"Cast dominate monster"},"description":{"value":[{"resource_id":"levelled_description","stats":{"description":{"value":"Save DC: 18"},"id":"0b0c134a-25a9-408d-afa1-ad00e3bbefbb"}}]},"trigger_type":{"value":"active"},"trigger_condition":{"value":{"resource_id":"trigger_condition_or","stats":{"id":"9414c468-7e9c-4333-94d2-3d3a528caa62"}}},"has_charges":{"value":true},"recharge_event":{"value":"dusk"},"max_charges_constant":{"value":1},"type":{"value":"use_spell"},"spell":{"value":{"resource_id":"spell","stats":{"name":{"value":"Dominate Monster"},"source":{"value":"phb"},"level":{"value":"spell_level_8"},"school":{"value":"spell_school_enchantment"},"casting_time":{"value":"1 action"},"range":{"value":"60 feet"},"duration":{"value":"Concentration, up to 1 hour"},"verbal":{"value":true},"somatic":{"value":true},"description":{"value":"You attempt to beguile a creature that you can see within range. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.\n\nWhile the creature is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as \"Attack that creature,\" \"Run over there,\" or \"Fetch that object.\" If the creature completes the order and doesn't receive further direction from you, it defends and preserves itself to the best of its ability.\n\nYou can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn't do anything that you don't allow it to do. During this time, you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.\n\nEach time the target takes damage, it makes a new Wisdom saving throw against the spell. If the saving throw succeeds, the spell ends."},"higher_level_description":{"value":"When you cast this spell with a 9th-level spell slot, the duration is concentration, up to 8 hours."},"classes":{"value":["bard","sorcerer","warlock","blood_hunter","fighter","rogue","wizard"]},"dice":{"value":[]},"updated_at":{"value":"2024-12-20T18:50:46.639386"},"id":"787197db-0402-41e8-901f-32fa8afe1324"}}},"id":"5af808a0-a12d-4b51-9c5e-c9e933549635"}},{"resource_id":"effect","stats":{"name":{"value":"Cast true polymorph"},"description":{"value":[{"resource_id":"levelled_description","stats":{"description":{"value":"Save DC: 18\nYou must cast it on a creature to turn it into a kind of creature that has an innate swimming speed"},"id":"a097a34e-4ad3-4757-88b1-b749d99274b8"}}]},"trigger_type":{"value":"active"},"trigger_condition":{"value":{"resource_id":"trigger_condition_or","stats":{"id":"5ea63568-7c50-4647-9bdf-795bbbb5702f"}}},"has_charges":{"value":true},"recharge_event":{"value":"dusk"},"max_charges_constant":{"value":1},"type":{"value":"use_spell"},"spell":{"value":{"resource_id":"spell","stats":{"name":{"value":"True Polymorph"},"source":{"value":"phb"},"level":{"value":"spell_level_9"},"school":{"value":"spell_school_transmutation"},"casting_time":{"value":"1 action"},"range":{"value":"30 feet"},"duration":{"value":"Concentration, up to 1 hour"},"verbal":{"value":true},"somatic":{"value":true},"material":{"value":true},"components":{"value":"a drop of mercury, a dollop of gum arabic, and a wisp of smoke"},"description":{"value":"Choose one creature or nonmagical object that you can see within range. You transform the creature into a different creature, the creature into an object or the object into a creature (the object must be neither worn nor carried by another creature). The transformation lasts for the duration, or until the target drops to 0 hit points or dies. If you concentrate on this spell for the full duration, the transformation becomes permanent.\n\nShapechangers aren't affected by this spell. An unwilling creature can make a Wisdom saving throw, and if it succeeds, it isn't affected by this spell.\n\nThe target assumes the hit points of its new form, and when it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn't reduce the creature's normal form to 0 hit points, it isn't knocked unconscious.\n\nThe creature is limited in the actions it can perform by the nature of its new form, and it can't speak, cast spells, or take any other action that requires hands or speech, unless its new form is capable of such actions.\n\nThe target's gear melds into the new form. The creature can't activate, use, wield, or otherwise benefit from any of its equipment.\n\nIf the spell becomes permanent, you no longer control the creature. It might remain friendly to you, depending on how you have treated it."},"classes":{"value":["bard","warlock","blood_hunter","fighter","rogue","wizard"]},"dice":{"value":[]},"updated_at":{"value":"2024-12-20T18:50:46.642472"},"id":"e9a0cd3c-78f2-4af1-878c-b42c9114511e"}}},"id":"46edc346-6bef-424e-8b80-508a9bc34fb0"}}]},"id":"f89027cc-be7e-4740-b624-bb10fd4cd093"}}